<?php
// include essential files
require_once('../common/essential.inc.php');

$db = new db();

/*$productInfo = "
            ('1','موبایل فروشی ها'),
('1','کامپیوتر و لوازم جانبی'),
('1','گل فروشی ها'),
('1','قهوه خانه ها و چایخانه ها و کافی شاپ'),
('1','ساندویچ فروشی ها و فست فود ها و پیتزا فروشی ها'),
('1','رستوران ها و چلوکبابی ها'),
('1','فروشندگان آجیل و خشکبار'),
('1','فروشندگان آبمیوه و بستنی'),
('1','موسسات خدمات چاپ و تکثیر'),
('1','طلا و ساعت فروشی ها'),
('1','فروشندگان لوازم آرایشی و بهداشتی'),
('1','آرایشگاه های مردانه کشور'),
('1','آرایشگاه های زنانه کشور'),
('1','فروشندگان لباس زنانه'),
('1','فروشندگان لباس مردانه و بچگانه'),
('1','فروشندگان لوازم بهداشتی و مصالح ساختمانی'),
('1','هتل های ایران'),
('1','دفاتر خدمات مسافرتی'),
('1','فروش لوازم خانگی'),
('1','سوپر مارکت ها'),
('1','فروشندگان گوشت و انواع پروتئین'),
('1','کفش و کیف زنانه و مردانه'),
('1','خدمات اتومبیل (صافکاری و تعمیر و اسپورت)'),
('1','موارد دیگر'),
('0','پوشاک (مردانه- زنانه – بچه گانه)'),
('0','لوازم آرایشی و بهداشتی'),
('0','لوازم بهداشتی و مصالح ساختمانی '),
('0','لوازم خانگی'),
('0','انواع گوشت و پروتئین'),
('0','هتل های ایران'),
('0','موبایل فروشی ها'),
('0','کامپیوتر و لوازم جانبی'),
('0','خوار و بار'),
('0','موارد دیگر')
        ";

$result = $db->bulkInsert(
    "tbl_producttype","sale_type, type_name",$productInfo
);
return $result;*/

$result = $db->update("tbl_brand","brand_name='متفرقه'","WHERE brand_id=4");
echo $result;